/*
	Interface routine for 68kem <-> Mame
*/

#include "driver.h"
#include "m68000.h"

struct m68k_memory_interface a68k_memory_intf;

// If we are only using assembler cores, we need to define these
// otherwise they are declared by the C core.

#if 0 //ks hcmame s switch m68k core
#if HAS_M68000
#undef A68K0
#define A68K0
#endif

#if HAS_M68010
#undef A68K1
#define A68K1
#endif

#if HAS_M68020
#undef A68K2
#define A68K2
#endif
#endif //ks hcmame e switch m68k core


#if 0 //ks hcmame s switch m68k core
#if defined(A68K0) || defined(A68K1) || defined(A68K2)
int m68k_ICount;
struct m68k_memory_interface m68k_memory_intf;
offs_t m68k_encrypted_opcode_start[MAX_CPU];
offs_t m68k_encrypted_opcode_end[MAX_CPU];

void m68k_set_encrypted_opcode_range(int cpunum, offs_t start, offs_t end)
{
	m68k_encrypted_opcode_start[cpunum] = start;
	m68k_encrypted_opcode_end[cpunum] = end;
}
#endif
#endif //ks hcmame e switch m68k core

enum
{
	M68K_CPU_TYPE_INVALID,
	M68K_CPU_TYPE_68000,
	M68K_CPU_TYPE_68008,
	M68K_CPU_TYPE_68010,
	M68K_CPU_TYPE_68EC020,
	M68K_CPU_TYPE_68020,
	M68K_CPU_TYPE_68030,	/* Supported by disassembler ONLY */
	M68K_CPU_TYPE_68040		/* Supported by disassembler ONLY */
};

#define A68K_SET_PC_CALLBACK(A)     change_pc(A)

int illegal_op = 0 ;
int illegal_pc = 0 ;

UINT32 mem_amask;

#ifdef ENABLE_DEBUGGER
void m68k_illegal_opcode(void)
{
	logerror("Illegal Opcode %4x at %8x\n",illegal_op,illegal_pc);
}
#endif

unsigned int m68k_disassemble(char* str_buff, unsigned int pc, unsigned int cpu_type);

#ifdef _WIN32
#define CONVENTION __cdecl
#else
#define CONVENTION
#endif

/* Use the x86 assembly core */
typedef struct
{
	UINT32 d[8];             /* 0x0004 8 Data registers */
	UINT32 a[8];             /* 0x0024 8 Address registers */

	UINT32 isp;              /* 0x0048 */

	UINT32 sr_high;          /* 0x004C System registers */
	UINT32 ccr;              /* 0x0050 CCR in Intel Format */
	UINT32 x_carry;          /* 0x0054 Extended Carry */

	UINT32 pc;               /* 0x0058 Program Counter */

	UINT32 IRQ_level;        /* 0x005C IRQ level you want the MC68K process (0=None)  */
	UINT32 IRQ_cycles;       /* 0x0060 Interrupt cycles */

	/* Backward compatible with C emulator - Only set in Debug compile */

	UINT16 sr;
	UINT16 filler;

	int (*irq_callback)(int irqline);

	UINT32 previous_pc;      /* last PC used */

	void (*reset_callback)(void);
	void (*cmpild_instr_callback)(unsigned int, int);
	void (*rte_instr_callback)(void);
	int (*tas_instr_callback)(void);

	UINT32 sfc;              /* Source Function Code. (68010) */
	UINT32 dfc;              /* Destination Function Code. (68010) */
	UINT32 usp;              /* User Stack (All) */
	UINT32 vbr;              /* Vector Base Register. (68010) */

	UINT32 BankID;			 /* Memory bank in use */
	UINT32 CPUtype;		  	 /* CPU Type 0=68000,1=68010,2=68020 */
	UINT32 FullPC;
#ifdef ENABLE_DEBUGGER
	UINT32 asm68k_debug;     /* single step flag for debugger */
#endif
	struct m68k_memory_interface Memory_Interface;

} a68k_cpu_context;


#ifdef A68K0
